
	<?php
		/*	ಇದು ಸಿ ಪ್ರೋಗ್ರಾಂನಲ್ಲಿರುವಂತೆ, ಬಹುಸಾಲಿನ ಕಾಮೆಂಟ್ ಆಗಿದೆ
			ಕಂಪೈಲರ್ ಅಥವಾ ಇಂಟರ್ಪ್ರಿಟರ್ ಕಾಮೆಂಟ್‌ಗಳನ್ನು ನಿರ್ಲಕ್ಷಿಸುತ್ತದೆ
			ಕಾಮೆಂಟ್‌ಗಳು ಪ್ರೋಗ್ರಾಮರ್‌ಗಳಿಗೆ ಕೋಡ್ ಅನ್ನು ಚೆನ್ನಾಗಿ ಅರ್ಥಮಾಡಿಕೊಳ್ಳಲು ಸಹಾಯ ಮಾಡಬಹುದು
		
			ಲಿನಕ್ಸ್, ಟರ್ಮಿನಲ್ ತೆರೆಯಲು ಶಾರ್ಟ್‌ಕಟ್ ಕೀಗಳು
				ಎಲ್ಲಾ ಕೀಬೋರ್ಡ್ ಕೀಗಳನ್ನು ಒಟ್ಟಿಗೆ ಒತ್ತಿ, ctrl alt t

			(ವಿಂಡೋಸ್‌ನಲ್ಲಿರುವ ಟಾಸ್ಕ್‌ಬಾರ್‌ಗಿಂತ ಭಿನ್ನವಾಗಿ,
				ಕೆಳಭಾಗದಲ್ಲಿ ಅಡ್ಡ ಪಟ್ಟಿ)
			ಉಬುಂಟುನಲ್ಲಿ ಡಾಕರ್, ಲಾಂಚರ್, ಎಡಭಾಗದಲ್ಲಿ ಲಭ್ಯವಿದೆ
				ಲಂಬ ಕಾಲಮ್ ದಂತೆ
			
			ತೆರೆದ ಅಪ್ಲಿಕೇಶನ್‌ಗಳು , ಟರ್ಮಿನಲ್, ಜಿಎಡಿಟ್, ಫೈರ್‌ಫಾಕ್ಸ್‌
				ಡಾಕ್, ಲಾಂಚರ್‌ನಲ್ಲಿ ಲಭ್ಯವಿರುತ್ತದೆ
		*/
	?>

	<?php
		/*	ಪೂರ್ವನಿಯೋಜಿತವಾಗಿ, ಜಿಎಡಿಟ್ ಫೈಲ್‌ಗಳನ್ನು /home/username ಡೈರೆಕ್ಟರಿಯಲ್ಲಿ ಉಳಿಸುತ್ತದೆ
		
			ಪ್ರೋಗ್ರಾಂ ಬರೆಯುವಾಗ, ಮೊದಲ ಕೆಲಸ ಕೋಡ್ ಉಳಿಸಿ
				ಫೈಲ್ ಹೆಸರಿನ ನಂತರ . ಮತ್ತು ಫೈಲ್ ವಿಸ್ತರಣೆಯೊಂದಿಗೆ			
			ಪಿಎಚ್ಪಿ ಪ್ರೋಗ್ರಾಂಗಳಿಗಾಗಿ, .php ಫೈಲ್ ವಿಸ್ತರಣೆಯೊಂದಿಗೆ ಕೋಡ್ ಅನ್ನು ಉಳಿಸಿ
			ಎಲ್ಲಿ: /var/www/html/
				ಮೊದಲ "/" ಅನ್ನು "ರೂಟ್" ಫೋಲ್ಡರ್ ಎಂದೂ ಕರೆಯಲಾಗುತ್ತದೆ
				ಕೋಡ್ ಅನ್ನು ಇಲ್ಲಿ ಉಳಿಸಲಾಗುತ್ತದೆ: /var/www/html/code.php
		*/				
	?>

	<?php
		/*	ಹೇಗೆ:
			ಜಿಎಡಿಟ್ ನಲ್ಲಿ ಕೋಡ್ ಬರೆಯುತ್ತಿದ್ದರೆ, ≡ ಅಡಿಯಲ್ಲಿ "save as" ಆಯ್ಕೆ
				≡ → ಹೀಗೆ ಉಳಿಸಿ → ಕೆಳಗಿನ ಎಡಭಾಗವು "other location" ಹೊಂದಿದೆ
				ಇತರ ಸ್ಥಳ → ಕಂಪ್ಯೂಟರ್ (ಅಥವಾ /) → var → www → html
			ಅಥವಾ 
			ಫೈಲ್‌ಗಳು (ಫೈಲ್ ಬ್ರೌಸರ್)
				code.php ಮೇಲೆ ಬಲ ಕ್ಲಿಕ್ ಮಾಡಿ
				cut ಬಳಸಿ, cut ಮೇಲೆ ಕ್ಲಿಕ್ ಮಾಡಿ
				ಮತ್ತು
				paste, ಬಲ ಕ್ಲಿಕ್ ಮಾಡಿ paste
					/var/www/html ಫೋಲ್ಡರ್‌ಗೆ ಫೈಲ್ ಬ್ರೌಸ್ ಮಾಡಿದ ನಂತರ
			ಅಥವಾ
			ಟರ್ಮಿನಲ್ ಮತ್ತು ಆಜ್ಞೆಗಳ ಬಳಕೆ ಒಳ್ಳೆಯ ಅನುಭವವಿದ್ದರೆ
				mv ಕಮಾಂಡ್ ಬಳಸಿ, move ಕಮಾಂಡ್, $ mv source destination
					$ mv code.php /var/www/html/
				ಅಥವಾ cp ಕಮಾಂಡ್ ಬಳಸಿ, copy ಕಮಾಂಡ್, $ cp source destination
					$ cp code.php /var/www/html/
			
			code.php ದೋಷಗಳನ್ನು ಹೊಂದಿಲ್ಲದಿದ್ದರೆ, ಮತ್ತು Apache httpd
				ಅಪ್ಲಿಕೇಶನ್ ಚಾಲನೆಯಲ್ಲಿದೆ, ಮತ್ತು php ತಂತ್ರಾಂಶವನ್ನು ಅನುಸ್ಥಾಪಿಸಿದ್ಧರೆ 
				code.php ಅನ್ನು ಮೊಜಿಲ್ಲಾ ಫೈರ್‌ಫಾಕ್ಸ್ ಮೂಲಕ ತೆರೆಯಬಹುದು
				ಫೈರ್‌ಫಾಕ್ಸ್ (ವೆಬ್ ಬ್ರೌಸರ್)
					"ವಿಳಾಸ ಪಟ್ಟಿಯಲ್ಲಿ", URL ಟೈಪ್ ಮಾಡಿ
						http://localhost/code.php
						ಅಥವಾ
						http://127.0.0.1/code.php
							 ಮತ್ತು ಎಂಟರ್ ಮಾಡಿ ↵ ಅಥವಾ → ಕ್ಲಿಕ್ ಮಾಡಿ
		*/
	?>	






	<?php
		/*		
			code.php ನಲ್ಲಿ ದೋಷಗಳಿದ್ದರೆ, ಟರ್ಮಿನಲ್ ನಲ್ಲಿ ದೋಷ ವಿವರಣೆಯನ್ನು ಪರಿಶೀಲಿಸಿ
				$ php code.php
					ಓದಿ, ಅರ್ಥಮಾಡಿಕೊಳ್ಳಿ ಮತ್ತು ದೋಷವನ್ನು ಸರಿಪಡಿಸಿ ಮತ್ತು ಮರುಪ್ರಯತ್ನಿಸಿ
					
			code.php ಅನ್ನು ಪ್ರಸ್ತುತ/ಕೆಲಸ ಮಾಡುತ್ತಿರುವ ಡೈರೆಕ್ಟರಿಯಲ್ಲಿ ಉಳಿಸಲಾಗಿದೆ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ
			ಮತ್ತು
			ಪ್ರಸ್ತುತ/ಕೆಲಸ ಮಾಡುತ್ತಿರುವ ಡೈರೆಕ್ಟರಿ /var/www/html/ ಆಗಿದೆಯೆ
			
			ಟರ್ಮಿನಲ್‌ನಲ್ಲಿ ಪ್ರಸ್ತುತ/ಕೆಲಸದ ಡೈರೆಕ್ಟರಿಯನ್ನು ಪರಿಶೀಲಿಸಲು
				$ pwd
				
			ಟರ್ಮಿನಲ್‌ನಲ್ಲಿ, ಪ್ರಸ್ತುತ ಡೈರೆಕ್ಟರಿಯಲ್ಲಿರುವ ಫೈಲ್‌ಗಳನ್ನು ಪರಿಶೀಲಿಸಲು
				$ ls
			ls, ಡೈರೆಕ್ಟರಿಯಲ್ಲಿರುವ ಫೈಲ್‌ಗಳು ಪಟ್ಟಿ ಮಾಡಿ, code.php ಪಟ್ಟಿಯಲ್ಲಿ ಇರಬೇಕು
			
			ಡೈರೆಕ್ಟರಿಯನ್ನು ಬದಲಾಯಿಸಲು,
				ಫೈಲ್ನು ಅಪ್ಲಿಕೇಶನ್‌ ಬಳಸುವುದು (ಫೈಲ್ ಬ್ರೌಸರ್)
					/var/www/html ಗೆ ಬ್ರೌಸ್ ಮಾಡಿ
					ಪ್ರದರ್ಶಿಸಲಾದ ಫೋಲ್ಡರ್ ಪ್ರದೇಶದಲ್ಲಿ ಬಲ ಕ್ಲಿಕ್ ಮಾಡಿ
						ಫೈಲ್/ಫೋಲ್ಡರ್ ಹೊರತುಪಡಿಸಿ
						
						Open in terminal
				ಅಥವಾ
				ಟರ್ಮಿನಲ್ ಮತ್ತು ಆಜ್ಞೆಯನ್ನು ಬಳಸಿಕೊಂಡು,
					cd, ಶೆಲ್ ಕೆಲಸ ಮಾಡುವ ಡೈರೆಕ್ಟರಿಯನ್ನು ಬದಲಾಯಿಸಿ
						$ cd /var/www/html
		*/
	?>	

	<?php
		/*	
			ಸಲಹೆಗಳು, ಸಾಮಾನ್ಯ ದೋಷಗಳು
			
			ನೀವು ಸಿ ಅಥವಾ ಜಾವಾಸ್ಕ್ರಿಪ್ಟ್ ಬರೆಯುತ್ತಿದ್ದೀರಿ ಎಂದು ಪರಿಗಣಿಸಿ.
				End statements, expressions with ;

			ಪಿಎಚ್ಪಿ ಯಲ್ಲಿನ ಪ್ರಮುಖ ಬದಲಾವಣೆಗಳು:
				ವೇರಿಯೇಬಲ್ ಹೆಸರು ಡಾಲರ್ ಚಿಹ್ನೆ $ ನೊಂದಿಗೆ ಪ್ರಾರಂಭವಾಗುತ್ತದೆ
				ಮತ್ತು ಕ್ರಿಯಾತ್ಮಕವಾಗಿ ಟೈಪ್ ಮಾಡಲಾಗುತ್ತದೆ, ಸಂದರ್ಭಕ್ಕೆ ಅನುಗುಣವಾಗಿ ಪ್ರಕಾರವನ್ನು ನಿರ್ಧರಿಸಲಾಗುತ್ತದೆ
			
			ಇಂಡೆಂಟೇಶನ್
				ಪೈಥಾನ್‌ನಂತೆ ಸಿಂಟ್ಯಾಕ್ಸ್‌ನ ಭಾಗವಲ್ಲದಿದ್ದರೂ
					ಆದರೆ ದಯವಿಟ್ಟು py ನಲ್ಲಿ ಮಾಡುವಂತೆ ಇಂಡೆಂಟೇಶನ್ ಬಳಸಿ
				
					ಕೀಬೋರ್ಡ್‌ನ ಟ್ಯಾಬ್ ಕೀಯನ್ನು ಬಳಸಿಕೊಂಡು ಮಾಡಬಹುದು
					ಅಥವಾ
					ಕೀಬೋರ್ಡ್‌ನ ಸ್ಪೇಸ್‌ಬಾರ್ ಕೀಯನ್ನು ಬಳಸಿಕೊಂಡು ನಾಲ್ಕು ಸ್ಪೇಸ್‌ಗಳು
			
			ಸಿಂಟ್ಯಾಕ್ಸ್‌ನ ಭಾಗವಲ್ಲದಿದ್ದರೂ
				ದಯವಿಟ್ಟು ಇಡೀ ಪ್ರೋಗ್ರಾಂ ಅನ್ನು ಒಂದೇ ಕಾಲಂನಲ್ಲಿ ಪ್ರಾರಂಭಿಸಬೇಡಿ
				
				
		*/
	?>
	
			










	<?php
		/*	
			ಸಮಸ್ಯೆಯ ವ್ಯಾಖ್ಯಾನ, ನಂತರ ಪ್ರೋಗ್ರಾಂ
		*/
	?>

	<?php
		/*	ನೀಡಿರುವ ಪ್ರೋಗ್ರಾಂ ಅನುಸರಿಸಬೇಕಾಗಿಲ್ಲ
			ಪ್ರೋಗ್ರಾಂ ದೀರ್ಘ ಮತ್ತು ಜಟಿಲವಾಗಿವೆ ಮತ್ತು ಅವುಗಳನ್ನು 
				ಸರಳೀಕರಿಸಬಹುದು, ಸುಧಾರಿಸಬಹುದು ಎಂದು ನೀವು ಭಾವಿಸಿದರೆ, ದಯವಿಟ್ಟು ಬರೆಯಿರಿ
					ಪ್ರೋಗ್ರಾಂಗಳು ಸಮಸ್ಯೆಯ ವ್ಯಾಖ್ಯಾನಗಳನ್ನು ಪೂರೈಸುವವರೆಗೆ
			
			ಪಿಎಚ್ಪಿ ಪ್ರೋಗ್ರಾಮಿಂಗ್, ಸಮಸ್ಯೆಯ ವ್ಯಾಖ್ಯಾನಗಳನ್, ದಯವಿಟ್ಟು ಪಠ್ಯಕ್ರಮವನ್ನು ನೋಡಿ
				https://vtu.ac.in/pdf/2022_3to8/2aimlsyll.pdf
		*/
	?>			
	
